{
  "meta": {
    "theme": "elegant"
  },
  "basics": {
    "name": "Nick Peterson",
    "label": "Full Stack Software Engineer",
    "image": "https://avatars.githubusercontent.com/u/45719932",
    "summary": "Full Stack engineer with 4 years of experience in Web Development. I would love the opportunity to contribute to your team!",
    "email": "nick.peterson@alumni.ubc.ca",
    "location": {
      "city": "Minneapolis",
      "state": "Minnesota"
    },
    "profiles": [
      {
        "username": "nipeters",
        "url": "https://www.linkedin.com/in/nipeters/",
        "network": "linkedin"
      },
      {
        "url": "https://github.com/nicklpeterson",
        "username": "nicklpeterson",
        "network": "github"
      }
    ]
  },
  "education": [
    {
      "endDate": "2018-01-09",
      "startDate": "2021-01-05",
      "area": "Computer Science",
      "studyType": "Bachelors",
      "institution": "The University of British Columbia"
    },
    {
      "endDate": "2011-01-09",
      "startDate": "2015-01-05",
      "area": "Mathematics & Economics",
      "studyType": "Bachelors",
      "institution": "The University of Minnesota Duluth"
    }
  ],
  "skills": [
    {
      "keywords": [
        "HTML",
        "CSS",
        "SCSS",
        "Styled Components",
        "Javascript",
        "Typescript",
        "React",
        "Next",
        "Webpack",
        "Module Federation"
      ],
      "level": "Senior",
      "name": "Frontend"
    },
    {
      "keywords": [
        "Node",
        "Deno",
        "Kotlin",
        "Java",
        "Micronaut",
        "Spring",
        "Mongo",
        "Postgres",
        "Redis"
      ],
      "level": "Senior",
      "name": "Backend"
    },
    {
      "keywords": [
        "Google Cloud",
        "Terraform",
        "Fastly CDN",
        "Vela",
        "Automated CI / CD"
      ],
      "level": "Senior",
      "name": "Devops"
    }
  ],
  "work": [
    {
      "website": "https://target.com/",
      "name": "Target Corporation",
      "location": "Minneapolis, MN",
      "position": "Senior Software Engineer",
      "startDate": "2020-05-05",
      "highlights": [
        "Collaborated with a team of business leaders, engineers, designers, and product owners in the design and implementation of new, built from scratch, e-commerce platform for the bulk purchase of Gift Cards by Business Clients. Including external, internal, and agent facing web apps. Our platform went live in June 2024 and is on track to facilitate over $250 million in revenue this year.", 
        "Implemented User Interfaces using Next.JS, React, Typescript, React Query, and Webpack.", 
        "Developed a PCI compliant micro-frontend that was built using Webpack Module Federation and deployed as a static javascript bundle to Google Cloud Platform.", 
        "Designed and implemented frontend and backend performance monitoring and alerting patterns using InfluxDB, Kibana, Grafana, and Shuttle IO.",
        "Developed REST API Microservices using Micronaut and Kotlin.",
        "Led the production environment set up and roll out effort. We had a clean prouction go live with no major incidents.",
        "Led the security development efforts including setting up frontend and backend controls to prevent known attack vectors. Prioritizing secure development from the beginning resulted in our PEN tests coming back with no major findings, saving us time and resources.",
        "Designed and built a Kafka filtering service that allowed the team to test our data migration in a \"Go-Live\" environment while ensuring that production PI data would not leak into lower environments.",
        "Supported the team through mentorship of Interns and Engineers.",
        "Developed two side project tools, git1s and git-history, that are used by engineers throughout Target Tech to more effectively use Github."
      ]
    },
    {
      "website": "https://livelyapps.com/",
      "name": "Lively Apps",
      "location": "Vancouver, BC",
      "position": "Full Stack Developer",
      "startDate": "2020-01-01",
      "endDate": "2021-01-08",
      "highlights": [
        "Developed and maintained apps currently available on the Atlassian marketplace for Confluence and Jira. Including Pocket Query, Task Reminder, Hide Elements, Usage Statistics for Confluence and more.",
        "Win second place in the 2020 Codegeist hackathon for the Lively Recorder.",
        "Developed frontend and backend features using Typescript, JQuery, React, Java and Spring.",
        "Solved support tickets, interacting directly with customers."
      ]
    },
    {
      "highlights": [
        "Designed and built an internal tool that automated the scraping of test data from Garmin devices, saving QA engineers hours of time each week.",
        "Authored and maintained well organized test cases",
        "Developed internal tools using Python and C++"
      ],
      "pinned": true,
      "website": "https://www.garmin.com/en-US/",
      "name": "Garmin",
      "position": "Software Quality Assurance Intern",
      "startDate": "2019-01-09",
      "endDate": "2019-01-12"

    }
  ]
}
